In [1]:
%load_ext sql
%sql sqlite:///ejercicio2(copia).db

'Connected: None@ejercicio2(copia).db'

In [2]:
%%sql create table profesor (nif varchar(10),
                             nombre char(30),
                             edad int(2),
                             cargo char(30),
                             especialidad char(30),
                             primary key (nif));

Done.

[]

In [7]:
%sql INSERT INTO profesor VALUES ('123456789A', 'Juan', 30, 'Profesor', 'Teleco');

1 rows affected.

[]

In [9]:
%sql INSERT INTO profesor VALUES ('111111111B', 'Pepe', 20, 'Prof. Adjunto', 'Teleco');
%sql INSERT INTO profesor VALUES ('222222222C', 'María', 50, 'Prof. Nuevo', 'Señales');
%sql INSERT INTO profesor VALUES ('333333333D', 'Luisa', 45, 'Investigador', 'Radio');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%sql SELECT * FROM profesor

Done.

[('123456789A', 'Juan', 30, 'Profesor', 'Teleco'),
 ('111111111B', 'Pepe', 20, 'Prof. Adjunto', 'Teleco'),
 ('222222222C', 'María', 50, 'Prof. Nuevo', 'Señales'),
 ('333333333D', 'Luisa', 45, 'Investigador', 'Radio')]

In [11]:
%%sql create table proyecto (num int,
                             entidad char(30),
                             comienzo date,
                             finalizacion date,
                             presupuesto float,
                             nif_prof varchar(10) not null,
                             primary key (num),
                             URJCforeign key (nif_prof) references profesor(nif));

Done.

[]

In [14]:
%sql INSERT INTO proyecto VALUES (1, 'URJC', '2016-01-01', '2016-12-20', 200000, '333333333D');
%sql INSERT INTO proyecto VALUES (2, 'Caixa', '2016-02-15', '2017-05-25', 200000, '111111111B');
%sql INSERT INTO proyecto VALUES (3, 'BBVA', '2015-10-20', '2016-02-10', 200000, '123456789A');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%sql INSERT INTO proyecto VALUES (4, 'Bankia', '2014-10-20', '2015-02-10', 400000, '123456789A');

1 rows affected.

[]

In [17]:
%sql SELECT * FROM proyecto

Done.

[(1, 'URJC', '2016-01-01', '2016-12-20', 200000.0, '333333333D'),
 (2, 'Caixa', '2016-02-15', '2017-05-25', 200000.0, '111111111B'),
 (3, 'BBVA', '2015-10-20', '2016-02-10', 200000.0, '123456789A'),
 (4, 'Bankia', '2014-10-20', '2015-02-10', 400000.0, '123456789A')]

In [22]:
%sql SELECT P.nombre, Py.entidad, Py.num FROM profesor P, Proyecto Py WHERE P.nif = Py.nif_prof;

Done.

[('Luisa', 'URJC', 1),
 ('Pepe', 'Caixa', 2),
 ('Juan', 'BBVA', 3),
 ('Juan', 'Bankia', 4)]

In [38]:
%%sql create table departamento(num int,
                                nombre char(30),
                                edificio int(2),
                                nif_prof_dir varchar(10) not null,
                                primary key (num),
                                foreign key (nif_prof_dir) references profesor(nif));

Done.

[]

In [45]:
%sql INSERT INTO departamento VALUES (1, 'Señales', 2, '123456789A');
%sql INSERT INTO departamento VALUES (2, 'Comunicaciones', 1, '222222222C');
%sql INSERT INTO departamento VALUES (3, 'Programación', 3, '111111111B');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [49]:
%sql SELECT * FROM departamento

Done.

[(1, 'Señales', 2, '123456789A'),
 (2, 'Comunicaciones', 1, '222222222C'),
 (3, 'Programación', 3, '111111111B')]

In [59]:
%%sql create table estudiante (nombre char(30), 
                               edad int, 
                               nif varchar(10), 
                               titulacion char(30),
                               nif_tutor varchar(10) not null,
                               num_dept int not null,
                               primary key (nif),
                               foreign key (nif_tutor) references estudiante(nif),
                               foreign key (num_dept) references departamento(num));

Done.

[]

In [60]:
%sql INSERT INTO estudiante VALUES ('Sheila', 21, '000000000A', 'Ing. Tecn. Teleco', '000000000M', 1);
%sql INSERT INTO estudiante VALUES ('Adrian', 25, '000000000B', 'Marketing', '000000000N', 2);
%sql INSERT INTO estudiante VALUES ('Elena', 23, '000000000C', 'ADE', '000000000M', 2);
%sql INSERT INTO estudiante VALUES ('Kevin', 26, '000000000D', 'Ing. Sist. Teleco', '000000000P', 3);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [72]:
%sql INSERT INTO estudiante VALUES ('Andrea', 23, '000000000M', 'Ing. Telem', '000000000P', 3);
%sql INSERT INTO estudiante VALUES ('Yoli', 30, '000000000N', 'Ing. Inf.', '000000000M', 1);
%sql INSERT INTO estudiante VALUES ('Gustavo', 26, '000000000P', 'Arquitec', '000000000N', 2);

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [73]:
%sql SELECT * FROM estudiante

Done.

[('Sheila', 21, '000000000A', 'Ing. Tecn. Teleco', '000000000M', 1),
 ('Adrian', 25, '000000000B', 'Marketing', '000000000N', 2),
 ('Elena', 23, '000000000C', 'ADE', '000000000M', 2),
 ('Kevin', 26, '000000000D', 'Ing. Sist. Teleco', '000000000P', 3),
 ('Andrea', 23, '000000000M', 'Ing. Telem', '000000000P', 3),
 ('Yoli', 30, '000000000N', 'Ing. Inf.', '000000000M', 1),
 ('Gustavo', 26, '000000000P', 'Arquitec', '000000000N', 2)]

In [68]:
%sql SELECT E.nombre, D.nombre AS Dept FROM estudiante E, departamento D WHERE E.num_dept = D.num;

Done.

[('Sheila', 'Señales'),
 ('Adrian', 'Comunicaciones'),
 ('Elena', 'Comunicaciones'),
 ('Kevin', 'Programación')]

In [70]:
%%sql create table ayuda_en(num_proy int,
                            nif varchar(10) not null,
                            primary key (num_proy, nif),
                            foreign key (num_proy) references proyecto(num),
                            foreign key (nif) references estudiante(nif));

Done.

[]

In [74]:
%sql INSERT INTO ayuda_en VALUES (4, '000000000B');
%sql INSERT INTO ayuda_en VALUES (2, '000000000M');
%sql INSERT INTO ayuda_en VALUES (1, '000000000P');
%sql INSERT INTO ayuda_en VALUES (2, '000000000D');
%sql INSERT INTO ayuda_en VALUES (3, '000000000A');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [75]:
%sql SELECT * FROM ayuda_en

Done.

[(4, '000000000B'),
 (2, '000000000M'),
 (1, '000000000P'),
 (2, '000000000D'),
 (3, '000000000A')]

In [79]:
%sql SELECT A.num_proy, E.nombre FROM ayuda_en A, estudiante E WHERE E.nif = A.nif;

Done.

[(4, 'Adrian'), (2, 'Andrea'), (1, 'Gustavo'), (2, 'Kevin'), (3, 'Sheila')]

In [80]:
%%sql create table trabaja (num_proy int,
                            nif varchar(10) not null,
                            primary key (num_proy, nif),
                            foreign key (num_proy) references proyecto(num),
                            foreign key (nif) references profesor(nif));

Done.

[]

In [42]:
%sql SELECT * FROM trabaja

Done.

[]

In [43]:
%%sql create table trabaja_en (tiempo int,
                            num_dep int not null,
                            nif varchar(10),
                            primary key (num_dep, nif),
                            foreign key (num_dep) references departamento(num),
                            foreign key (nif) references profesor(nif));

Done.

[]

In [44]:
%sql SELECT * FROM trabaja_en

Done.

[]

In [45]:
%%sql create table supervisa(nif_prof varchar(10),
                            nif_est varchar(10),
                            num_proy int,
                            primary key (nif_prof, nif_est, num_proy),
                            foreign key (nif_prof) references profesor(nif),
                            foreign key (nif_est, num_proy) references ayuda_en(nif, num_proy));

Done.

[]

In [47]:
%sql SELECT * FROM supervisa

Done.

[]